# 1
print("1st Task")
example = "Программирование"
print(example)                    # отступ для наглядности
print()

# 2
print("2nd Task")
print(example[0])                 # Первый символ строки
print()

# 3
print("3rd Task")
print(example[-1])                # Последний символ строки
print()

# 4
print("4th Task")
y = (len(example))                # узнаем длину строки
print(y)                          # смотрим длину строки

if y % 2 == 0:                    # если длина строки четная
    print(example[y // 2 - 1 : ]) # пополам на цело и на 1 символ > для второй половины
else:                             # иначе...
    print(example[y // 2 : ])     # пополам на цело и на 1 символ < для второй половины
print()

# 5
print("5th Task")
print(example[::-1])              # обратный шаг для строки
print()

# 6
print("6th Task")
print(example[1::2])               # со 2го символа шаг 2 для строки
print()

# PS: Special
print("Special")
print("Введите строчное значение: ")
x = input()
print()

print("Введено строчное значение: ", x)
print("Значение имеет тип: ", type(x))
print()

print("Первый символ: ", x[0])                 # Первый символ строки
print()

print("Последний символ: ", x[-1])                # Последний символ строки
print()

long = (len(x))                # узнаем длину строки
print("Длина Вашего значения = ", long)
print()

if long % 2 == 0:                    # если длина строки четная
  print("На 1 символ бОльшая половина значения с конца: ", x[long // 2 - 1 : ]) # пополам на цело и на 1 символ > для второй половины
else:                             # иначе...
  print("На 1 символ бОльшая половина значения с конца: ", x[long // 2 : ])     # пополам на цело и на 1 символ < для второй половины
print()

print("Значение наоборот: ", x[::-1])
print()

print("Каждый второй символ значения: ", x[1::2])               # со 2го символа шаг 2 для строки
print()
